Tekla.Structures.Model.RebarHookDataNullable
The RebarHookDataNullable class defines the hook at the end of a reinforcing bar. Hooks are used for anchoring purposes.

Tekla.Structures.Model.RebarHookDataNullable.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarHookDataNullable class.

Tekla.Structures.Model.RebarHookDataNullable.Shape
Gets or sets the shape of the hook. The options are:
NO_HOOK. Sets the angle, radius and length to 0.
HOOK_90_DEGREES.
HOOK_135_DEGREES.
HOOK_180_DEGREES.
CUSTOM_HOOK. The angle, radius and length values have to be set manually.

Tekla.Structures.Model.RebarHookDataNullable.Angle
Gets or sets the angle of the hook. The value is between -270 to +270 degrees.

Tekla.Structures.Model.RebarHookDataNullable.Radius
Gets or sets the bending radius of the hook.

Tekla.Structures.Model.RebarHookDataNullable.Length
Gets or sets the length of the straight part of the hook.

Tekla.Structures.Model.RebarHookDataNullable.Rotation
Gets or sets the rotation of the hook.

Tekla.Structures.Model.RebarHookDataNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarHookData_t@)
The to struct method.
p: The dotRebarHookData_t struct.

Tekla.Structures.Model.RebarHookDataNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarHookData_t@)
The from struct method.
p: The dotRebarHookData_t struct.